var vue = new Vue({
	el: "#wrap",
	data: function() {
		return {
			wangzhe: "王者荣耀",
			tuandui: "团队成就更多",
			xiazai: "立即下载",
			shouye: "首页",
			gonglue: "攻略中心",
			caishi: "赛事中心",
			remen: "热门",
			xinwen: "新闻",
			gonggao: "公告",
			huodong: "活动",
			saishi: "赛事",
			s1: "关于活动【鹿灵少女的邀约】微信侧分享异常问题说明",
			s2: "4月2日全服不停机更新公告",
			s3: "踏青之旅活动周开启",
			s4: "【KPL今日预报】QG vs eStar，飞牛、猫神老友赛场再聚谁将获得胜利？",
			s5: "你是赛评师：RW侠又双叒叕赢了，改名卡了解一下？",
			s6: "iOS系统要求及升级指引公告",
			s7: "3月27日 【万物有灵】版本体验服更新公告",
			s8: "KRKPL：傲慢嘲讽控全场，CW.Play终极兵器白起所向披靡的关键技巧",
			s9: "4月8日 T-Cross 王者潮流之夜即将到来，与KPL大神一起血战沙场",
			s10: "KRKPL快讯：CW3：1ESC，白起夺命嘲讽宣告CW王者归来！",
			s11: "KRKPL快讯：Nova 3：0 SLT，中国选手yueli首秀化身线霸横空出世",
			s12: "4月6日体验服停机修复公告",
			s13: "【春季赛课代表】JC vs BA，谁能止住连败？",
			s14: "点击加载更多",
			t1: "2019-04-05",
			t2: "2019-04-01",
			t3: "2019-03-31",
			t4: "2019-03-30",
			t5: "2019-03-30",
			t6: "2019-03-30",
			t7: "2019-03-27",
			t8: "2019-04-07",
			t9: "2019-04-07",
			t10: "2019-04-06",
			t11: "2019-04-06",
			t12: "2019-04-06",
			t13: "2019-04-06"
		}
	}
})

//var vm = new Vue ({
//	el:".wrap",
//	data:function(){
//		return{
//		
//		}
//	}
//})

//var vm = new Vue({
//				el:".wrap",
//				data:function(){
//					return{
//						wangzhe:"王者荣耀",
//						tuandui:"团队成就更多",
//						xiazai:"立即下载",
//						shouye:"首页",
//						gonglue:"攻略中心",
//						caishi:"赛事中心",
//						remen:"热门",
//						xinwen:"新闻",
//						gonggao:"公告",
//						huodong:"活动",
//						saishi:"赛事"
//						s1:"关于活动【鹿灵少女的邀约】微信侧分享异常问题说明",
//						s2:"4月2日全服不停机更新公告",
//						s3:"踏青之旅活动周开启",
//						s4:"【KPL今日预报】QG vs eStar，飞牛、猫神老友赛场再聚谁将获得胜利？",
//						s5:"你是赛评师：RW侠又双叒叕赢了，改名卡了解一下？",
//						s6:"iOS系统要求及升级指引公告",
//						s7:"3月27日 【万物有灵】版本体验服更新公告",
//						s8:"KRKPL：傲慢嘲讽控全场，CW.Play终极兵器白起所向披靡的关键技巧",
//						s9:"4月8日 T-Cross 王者潮流之夜即将到来，与KPL大神一起血战沙场",
//						s10:"KRKPL快讯：CW3：1ESC，白起夺命嘲讽宣告CW王者归来！",
//						s11:"KRKPL快讯：Nova 3：0 SLT，中国选手yueli首秀化身线霸横空出世",
//						s12:"4月6日体验服停机修复公告",
//						s13:"【春季赛课代表】JC vs BA，谁能止住连败？",
//						s14:"点击加载更多",
//						t1:"2019-04-05",
//						t2:"2019-04-01",
//						t3:"2019-03-31",
//						t4:"2019-03-30",
//						t5:"2019-03-30",
//						t6:"2019-03-30",
//						t7:"2019-03-27",
//						t8:"2019-04-07",
//						t9:"2019-04-07",
//						t10:"2019-04-06",
//						t11:"2019-04-06",
//						t12:"2019-04-06",
//						t13:"2019-04-06"